{
    "answers": [
        "The MEAN stack is a set of technologies used to develop web applications: 1) MongoDB - a NoSQL database, 2) Express.js - a back-end web framework for Node.js, 3) Angular - a front-end web framework for building dynamic user interfaces, and 4) Node.js - a JavaScript runtime used for building server-side applications. The MEAN stack allows for end-to-end JavaScript development.",
        "JavaScript is a widely used programming language for building dynamic websites and web applications. JavaScript data types include primitive types such as numbers, strings, booleans, null, and undefined, as well as complex types such as objects and arrays. JavaScript frameworks are pre-written libraries or collections of reusable code that provide a structure and set of tools for developing web applications, such as Angular, React, and Vue.",
        "Threads are lightweight, independent sequences of instructions within a process that can be executed concurrently by a single CPU. Threads share the same memory space and file descriptors with their parent process, allowing for efficient communication and coordination. Threads can be used to achieve parallelism and improve performance in multi-core processors. There are various types of threads, such as user-level threads and kernel-level threads, with different levels of thread management and support from the operating system.",
        "In Python, a 'list' is mutable, meaning its elements can be modified, while a 'tuple' is immutable, meaning its elements cannot be changed. Tuples are generally used when the data should not be changed, providing safety and performance benefits, whereas lists are used for data that needs to be modified.",
        "Polymorphism in Java allows objects of different classes to be treated as objects of a common superclass. The two types of polymorphism in Java are method overloading (compile-time polymorphism) and method overriding (runtime polymorphism). Polymorphism enables flexible and reusable code by allowing methods to behave differently based on the object's actual type."
    ]
}