{
    "answers": [
        "Flask is a lightweight Python web framework designed for building simple, small-scale web applications. Unlike Django, which is a full-stack framework, Flask is minimalistic and provides the core features needed for web development, allowing you to add third-party extensions for additional functionality. Flask is ideal for small projects and APIs, while Django is better suited for large applications requiring built-in features like authentication and admin interfaces.",
        "JavaScript is a widely used programming language for building dynamic websites and web applications. JavaScript data types include primitive types such as numbers, strings, booleans, null, and undefined, as well as complex types such as objects and arrays. JavaScript frameworks are pre-written libraries or collections of reusable code that provide a structure and set of tools for developing web applications, such as Angular, React, and Vue.",
        "Processes are instances of a program in execution, managed by an operating system. They are isolated from each other and have their own memory space, file descriptors, and other system resources. Processes can communicate with each other through inter-process communication (IPC) mechanisms, and they can be in different states, such as running, waiting, or terminated. Processes are a fundamental concept in operating systems for managing and executing concurrent tasks.",
        "Python is a high-level, interpreted programming language known for its readability and simplicity. It supports multiple programming paradigms, including procedural, object-oriented, and functional programming. Python is popular due to its ease of learning, wide range of libraries and frameworks, and strong community support, making it suitable for web development, data science, machine learning, and automation.",
        "Java annotations are metadata added to Java code that provide additional information about classes, methods, or fields. They don't change the behavior of the code but are used for various purposes like code documentation, validation, and integration with tools. Examples include '@Override' and '@Entity'."
    ]
}