{
    "answers": [
        "A stack is a linear data structure that follows the Last-In, First-Out (LIFO) principle. It allows data to be added or removed only from the top, or the head, of the stack. Common stack operations include push (adding an element to the top of the stack), pop (removing the top element from the stack), and peek (viewing the top element without removing it). Stacks are used in many applications, such as function call stack, expression evaluation, and undo/redo functionality in software applications.",
        "A web framework is a collection of tools, libraries, and best practices for building web applications. It provides pre-built components for handling HTTP requests, routing, templates, and more. Using a web framework accelerates development by providing structure, reducing repetitive tasks, and ensuring scalability and security.",
        "Infrastructure as Code (IaC) is the practice of managing and provisioning computing infrastructure through machine-readable definition files, rather than through physical hardware configuration or interactive configuration tools. It is important because it enables automation, scalability, and consistency across environments. Tools like Terraform, AWS CloudFormation, and Ansible are commonly used for IaC.",
        "A Single Page Application (SPA) is a web application where the entire application loads in a single HTML page, and only the necessary content is dynamically updated as users interact with it. SPAs offer a faster user experience by reducing page reloads and provide smoother navigation. SPAs are often built with front-end frameworks like React or Angular and communicate with back-end APIs.",
        "The Java Virtual Machine (JVM) is a software-based engine that runs Java programs by interpreting bytecode. The JVM provides platform independence, meaning that Java applications can run on any system with a JVM installed. It also manages memory allocation and garbage collection, improving performance and security."
    ]
}