{
    "answers": [
        "Microservices architecture is a design pattern where an application is composed of small, independent services that can be deployed, scaled, and updated independently. DevOps practices, such as automation and continuous integration, are well-suited to manage microservices, as they help to deploy and monitor these services more effectively.",
        "A lambda function in Python is an anonymous function defined with the 'lambda' keyword. It can take any number of arguments but can only have one expression. Lambda functions are often used for short, simple operations that are passed as arguments to higher-order functions like `map`, `filter`, and `sorted`.",
        "A stack is a linear data structure that follows the Last-In, First-Out (LIFO) principle. It allows data to be added or removed only from the top, or the head, of the stack. Common stack operations include push (adding an element to the top of the stack), pop (removing the top element from the stack), and peek (viewing the top element without removing it). Stacks are used in many applications, such as function call stack, expression evaluation, and undo/redo functionality in software applications.",
        "JavaScript is a widely used programming language for building dynamic websites and web applications. JavaScript data types include primitive types such as numbers, strings, booleans, null, and undefined, as well as complex types such as objects and arrays. JavaScript frameworks are pre-written libraries or collections of reusable code that provide a structure and set of tools for developing web applications, such as Angular, React, and Vue.",
        "Full-stack development refers to the development of both the front-end and back-end of a web application. A full-stack developer has knowledge of both client-side (HTML, CSS, JavaScript) and server-side technologies (like Node.js, Python, Java), as well as databases (MySQL, MongoDB). Full-stack developers are capable of building and maintaining entire web applications from end to end."
    ]
}